In [59]:
import pymysql
import sqlalchemy as alch
from getpass import getpass
import pandas as pd

from getpass import getpass
password = getpass()

dbName = "erasmus"

connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

In [60]:
# 1. What is the average age of students who have outstanding grades? Provide the table with EXCELLENT if they have a 9 or 10, GOOD if they have 7 or 8, PASS if they have a 5 or 6, and FAIL if it is less than 5.

query = """
SELECT IF(grades.grades > 8,'EXCELLENT', IF(grades.grades > 6,'GOOD', IF(grades.grades >= 5,'PASS', 'FAIL'))) AS grade_category, ROUND(AVG(DATEDIFF(CURDATE(), students.dob)/365)) AS age
FROM grades
JOIN students ON grades.student_id = students.student_id
GROUP BY grade_category
"""

pd.read_sql_query(query, engine)

  grade_category   age
0           FAIL  27.0
1           GOOD  28.0
2      EXCELLENT  27.0
3           PASS  28.0

In [66]:
# 2. What is the average age of students by university?

query = """
SELECT university.uni_name, ROUND(AVG(DATEDIFF(CURDATE(), students.dob)/365)) AS age
FROM university
JOIN campus ON university.university_id = campus.university_id
JOIN students ON campus.campus_id = students.campus_id
GROUP BY university.uni_name
ORDER BY age DESC
"""

pd.read_sql_query(query, engine)

                                       uni_name   age
0                         Vanderbilt University  37.0
1                         University of Arizona  36.0
2                            Harvard University  35.0
3               University of California, Davis  35.0
4   University of North Carolina at Chapel Hill  34.0
5         University of California, Los Angeles  33.0
6                      University of Washington  33.0
7             University of Michigan, Ann Arbor  32.0
8            California Institute of Technology  30.0
9                        University of Virginia  30.0
10                        Georgetown University  30.0
11           University of California, Berkeley  30.0
12                              Yale University  29.0
13               University of Colorado Boulder  29.0
14        Massachusetts Institute of Technology  28.0
15                        University of Chicago  28.0
16                          Stanford University  28.0
17                   University of Pennsylvania  27.0
18                              Duke University  27.0
19                           Cornell University  27.0
20                              Rice University  27.0
21               Indiana University Bloomington  27.0
22                      Northwestern University  26.0
23                             Emory University  26.0
24                        University of Florida  26.0
25                        University of Georgia  26.0
26         University of Minnesota, Twin Cities  26.0
27              University of Wisconsin-Madison  25.0
28         University of Maryland, College Park  25.0
29                           University of Iowa  25.0
30                     Johns Hopkins University  24.0
31                     University of Notre Dame  24.0
32                     University of Pittsburgh  24.0
33                        Ohio State University  24.0
34                University of Texas at Austin  23.0
35                         Princeton University  22.0
36                             Brown University  22.0
37      University of Illinois Urbana-Champaign  22.0
38          University of California, San Diego  22.0
39                          Columbia University  21.0

In [109]:
# 3. What is the proportion of students who failed each subject? Provide the subject name, number of students who failed, total number of students, and the proportion of students who failed (as a percentage) for each subject. Display the results in descending order of the proportion of students who failed.

query = """
SELECT subjects.subj_name, COUNT(IF(grades.grades<5, 1, NULL)) AS number_of_failures, COUNT(student_id) AS number_of_students, (COUNT(IF(grades.grades<5, 1, NULL))/COUNT(student_id)) AS proportion_of_failures 
FROM subjects
JOIN grades ON subjects.subject_id = grades.subject_id
GROUP BY subjects.subj_name
"""

pd.read_sql_query(query, engine)

,subj_name,number_of_failures,number_of_students,proportion_of_failures
0,Seismic Interpreter,8,12,0.6667
1,Astronomy,4,14,0.2857
2,Computer Science,6,10,0.6000
3,History,3,9,0.3333
4,Machine Learning,4,9,0.4444
...,...,...,...,...
75,Neuropsychology,4,15,0.2667
76,Public Policy Analysis,5,14,0.3571
77,Environmental Engineering,9,18,0.5000
78,Business Ethics,5,11,0.4545
79,Geographic Information Systems,7,12,0.5833

In [124]:
# 4. What is the average grade of students who have done an erasmus compared to those who have not?

query = """
SELECT *
FROM international_agreement
"""

pd.read_sql_query(query, engine)

   agreement_code  home_university  away_university  student_id
0           123BH               19                4          21
1           14KK9               15                8          56
2           9OP82               22                6          44
3           A2B3C               11                2           9
4           A2B9C               36               37          74
..            ...              ...              ...         ...
87          Z1A1B                3               33          76
88          Z1A3C               19               33          21
89          Z2A3B               34               19          29
90          Z5A1B                7               33          41
91          Z8Y9A               36               40          24

[92 rows x 4 columns]

In [186]:
# 5. For each university, identify the number of bachelor’s, master’s and PhD degrees awarded. Provide the university ID and name along with the count.

query = """
SELECT university.uni_name, COUNT(IF(LEFT(bachelor.bachelor_id, 1)="B", 1, NULL)) as bachelor_count, COUNT(IF(LEFT(bachelor.bachelor_id, 1)="M", 1, NULL)) as master_count, COUNT(IF(LEFT(bachelor.bachelor_id, 1)="D", 1, NULL)) as phd_count
FROM bachelor
JOIN university ON bachelor.university_id = university.university_id
GROUP BY university.uni_name
"""

pd.read_sql_query(query, engine)

,uni_name,bachelor_count,master_count,phd_count
0,Harvard University,0,1,0
1,Stanford University,1,1,1
2,Massachusetts Institute of Technology,4,1,1
3,California Institute of Technology,3,0,0
4,Yale University,0,1,1
5,Princeton University,3,1,2
6,Columbia University,1,2,1
7,University of Chicago,0,2,0
8,University of Pennsylvania,2,1,1
9,Johns Hopkins University,1,1,0
10,Northwestern University,0,2,0
11,Duke University,2,1,1
12,Cornell University,2,2,0
13,Brown University,2,1,1
14,Rice University,1,1,1
15,University of Notre Dame,0,2,1
16,Vanderbilt University,1,0,2
17,Emory University,0,1,0
18,Georgetown University,2,1,1
19,"University of California, Berkeley",1,3,6
20,"University of Michigan, Ann Arbor",0,0,1
21,University of Virginia,3,2,0
22,"University of California, Los Angeles",0,1,3
23,University of North Carolina at Chapel Hill,0,0,2
24,University of Florida,1,0,1
25,University of Texas at Austin,0,1,0
26,University of Wisconsin-Madison,0,1,1
27,University of Washington,1,0,0
28,University of Georgia,0,1,1
29,"University of California, San Diego",2,2,1
30,"University of Maryland, College Park",0,0,2
31,"University of Minnesota, Twin Cities",1,1,1
32,University of Pittsburgh,0,0,2
33,University of Colorado Boulder,0,3,1
34,Indiana University Bloomington,3,2,0
35,Ohio State University,1,1,2
36,University of Iowa,0,0,1
37,"University of California, Davis",2,0,1